app/controllers/api/bookmarks_controller.rb

  def create
    @bookmark = Bookmark.new(bookmark_params)

    if @bookmark.save
      @business = Business.find(bookmark_params[:business_id])
---
INSERT INTO "bookmarks" ("user_id", "business_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 44], ["business_id", 142], ["created_at", "2019-02-21 04:21:46.978893"], ["updated_at", "2019-02-21 04:21:46.978893"]]
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]

  def destroy
    @bookmark = current_user.bookmarks.find(params[:id])
    @business = Business.find(params[:business_id])

    if @bookmark
      @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."id" = $2 LIMIT $3  [["user_id", 44], ["id", 28], ["LIMIT", 1]]
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 28]]