app/controllers/api/businesses_controller.rb

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
---
  def show
    @business = Business.find(params[:id])

SELECT "businesses".* FROM "businesses"
---
  def index
    @businesses = Business.all

SELECT "businesses".* FROM "businesses"
---
  def search

    if params[:queryFind] && params[:queryNear]
      @find_query = params[:queryFind].downcase
      @near_query = params[:queryNear].downcase

      @businesses = Business.all.select do |business|
        name = business.name.downcase
        city = business.city.downcase
        address = business.address.downcase
        (name.include?(@find_query)) && (city.include?(@near_query) || address.include?(@near_query))
      end
    elsif params[:queryNear]
      @near_query = params[:queryNear].downcase

      @businesses = Business.all.select do |business|