app/controllers/api/reactions_controller.rb

  def create
    @reaction = Reaction.new(reaction_params)

    if @reaction.save
      @review = Review.find(reaction_params[:review_id])
---
INSERT INTO "reactions" ("reaction_type", "user_id", "review_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["reaction_type", "cool"], ["user_id", 44], ["review_id", 87], ["created_at", "2019-02-21 04:22:53.324081"], ["updated_at", "2019-02-21 04:22:53.324081"]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]

  def index
    @business = Business.find(params[:business_id])
    @review = @business.reviews.find(params[:review_id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 142]]

  def destroy
    @business = Business.find(params[:business_id])
    @review = @business.reviews.find(params[:review_id])

    @reaction = current_user.reactions.find(params[:id])

    if @reaction
      @reaction.destroy
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 142]]
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = $1 AND "reactions"."id" = $2 LIMIT $3  [["user_id", 44], ["id", 134], ["LIMIT", 1]]
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 134]]