app/controllers/api/reviews_controller.rb

  def destroy
    @review = current_user.reviews.find(params[:id])

    if @review
      @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 106]]