app/views/api/reactions/index.json.jbuilder

SELECT "reactions".* FROM "reactions" WHERE "reactions"."review_id" = $1  [["review_id", 84]]
---
@reviews.each do |review|
  review.reactions.each do |reaction|