app/views/api/reactions/show.json.jbuilder

SELECT "reactions".* FROM "reactions" WHERE "reactions"."review_id" = $1  [["review_id", 87]]
---
@review.reactions.each do |reaction|