app/views/api/businesses/_business.json.jbuilder

SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 142]]
---
json.extract! business, :id, :name, :address, :city, :state, :phone_number, :latitude, :longitude
json.reviewsId business.reviews.pluck(:id)