app/views/api/businesses/show.json.jbuilder

json.reviews do
  @business.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 142]]

json.bookmarks do
  @business.bookmarks.each do |bookmark|
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."business_id" = $1  [["business_id", 142]]